Autodesk.Revit.DB.ReferenceableViewUtils.ChangeReferencedView(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.ElementId)
Changes a particular reference view (such as a reference section or reference callout) to refer to a different View.
Remarks:
Reference views may not refer to a View in which their own graphics (such as the section or callout
graphics) will appear.  If the reference view's ViewFamilyType is not appropriate
for the new View, Revit will automatically change the ViewFamilyType during regeneration.  This
typically occurs when the referenced view is changed from a model View to a drafting View or
vice-versa.
document:
The document containing the elements.
referenceId:
The reference view that will be changed to refer to a different View.
desiredViewId:
The id of the View that the reference section or callout will refer to.
Throws Autodesk.Revit.Exceptions.ArgumentException:
referenceId is not a valid reference view.
-or-
desiredViewId is not a view that can be referenced by referenceId.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2015

Autodesk.Revit.DB.ReferenceableViewUtils.GetReferencedViewId(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId)
Gets the id of the view referenced by a reference view (such as a reference section or reference callout).
document:
The document containing the elements.
referenceId:
The reference view that will be changed to refer to a different View.
Returns:
The id of the referenced view.
Throws Autodesk.Revit.Exceptions.ArgumentException:
referenceId is not a valid reference view.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2015

Autodesk.Revit.DB.ReferenceableViewUtils
Utilities related to reference views such as reference sections and reference callouts.
Since:
2015